"""
Каждому по компьютеру

Ограничение времени - 1 секунда
Ограничение памяти - 64Mb
Ввод - стандартный ввод
Вывод - стандартный вывод

В новом учебном году во Дворец Творчества Юных для занятий в компьютерных
классах пришли учащиеся, которые были разбиты на N групп. В i-й группе оказалось
X_i человек. Тут же перед директором встала серьёзная проблема: как распределить
группы по аудиториям. Во дворце имеется M ≥ N аудиторий, в j-й аудитории имеется
Y_j компьютеров. Для занятий необходимо, чтобы у каждого учащегося был компьютер
и ещё один компьютер был у преподавателя. Переносить компьютеры из одной
аудитории в другую запрещается. Помогите директору!

Напишите программу для поиска максимального количества групп, которое удастся
одновременно распределить по аудиториям, чтобы всем учащимся в каждой группе
хватило компьютеров, и при этом остался хотя бы один для учителя.


Формат ввода:
На первой строке входного файла расположены числа N и M (1 ≤ N ≤ M ≤ 1000).
На второй строке расположено N чисел — X_1, …, X_N (1 ≤ X_i ≤ 1000
для всех 1 ≤ i ≤ N). На третьей строке расположено M чисел Y_1, ..., Y_M
(1 ≤ Y_i ≤ 1000 для всех 1 ≤ i ≤ M).


Формат вывода:
Выведите на первой строке число P — количество групп, которое удастся
распределить по аудиториям. На второй строке выведите распределение групп по
аудиториям — N чисел, i-е число должно соответствовать номеру аудитории,
в которой должна заниматься i-я группа. Нумерация как групп, так и аудиторий,
начинается с 1. Если i-я группа осталась без аудитории, i-е число должно быть
равно 0. Если допустимых распределений несколько, выведите любое из них.


Пример 1:
input:
1 1
1
2
output:
1
1

Пример 2:
input:
1 1
1
1
output:
0
0
"""
import sys


def main(lines: list[str] | None = None) -> tuple[int, list[int]]:

    lines = lines or sys.stdin.read().splitlines()

    n, m = map(int, lines[0].split())
    groups = [(i, num+1) for i, num in enumerate(map(int, lines[1].split()), 1)]
    classrooms = list(enumerate(map(int, lines[2].split()), 1))

    groups.sort(key=lambda x: x[1])
    classrooms.sort(key=lambda x: x[1])

    count = 0
    distribution = [0] * n
    g_ptr = 0
    c_ptr = 0
    while g_ptr < n and c_ptr < m:
        i, group = groups[g_ptr]
        j, classroom = classrooms[c_ptr]
        if group <= classroom:
            count += 1
            distribution[i-1] = j
            g_ptr += 1
            c_ptr += 1
        else:
            c_ptr += 1

    return count, distribution


if __name__ == "__main__":
    result = main()
    print(result[0])
    print(*result[1])
